'use strict'

/*
	1. разница вар лет
	2. разница слайс сплайс
	3. метод every some
	4. регулярные выражения для строк
	5. json.stringify parce
	6. нюансы глубокого копирования
	7. опшинал чейнинг
	8. стек

	1. функция высшего порядка
	2. использование стрелочных в методах вместо обычных
	3. какая должна быть запись функции если надо получать неизвестное количество аргументов
	4. можно использовать рест оператор в аргументах функции?
	5. использование методов обьекта без свойтва
	6. как правильно выносить методы за обьекты и как часто используют кол и аплай
	7. как правильно обрабатывать события через джс или через атрибуты в штмл


 */